#define _CRT_SECURE_NO_WARNINGS
#define N 50
#include <locale.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <malloc.h>


struct gonka {
	char name[50];
	int time;
	int distance;
	int complexity;
	int avg_speed;
}*gon;
struct gonka add(struct gonka* gon, int count)
{
	if (count > 50)
	{
		printf("Недостаточно места для записи");

	}
	for (int z = 0; z < count; z++)
	{
		printf("Введите название соревнований = ");
		scanf("%s", gon->name);
		printf("Продолжительность гонки (в минутах) = ");
		scanf("%d", &gon->time);
		printf("Длина трассы(в метрах) = ");
		scanf("%d", &gon->distance);
		printf("Сложность (1-10) = ");
		scanf("%d", &gon->complexity);
		printf("Введите среднюю скорость = ");
		scanf("%d", &gon->avg_speed);
		printf("\n");
		gon++;
	}
	return *gon;
}
void vivod(struct gonka* gon, int count)
{
	printf("--------------------------------------------------------------------------------------------------------------------------------------------\n");
	printf("|| Номер  || Название соревнований  ||  Продолжительность гонки(мин)  ||  Длина трассы(метры)  ||  Сложность  ||  Средняя скорость(км/ч)  ||\n");
	printf("--------------------------------------------------------------------------------------------------------------------------------------------\n");
	for (int q = 0; q < count; q++)
	{
		printf("||%8d||%24s||%28d Мин||%21d М||%13d||%21d Км/ч||\n", q + 1, gon->name, gon->time, gon->distance, gon->complexity, gon->avg_speed);
		printf("--------------------------------------------------------------------------------------------------------------------------------------------\n");
		gon++;
	}

}
struct  gonka search(struct gonka* gon, int count)
{
	char kr1[10], kr2[10];
	int choice, kr3, kr4, kr5, flag2 = 1;
	printf("Выберите критерий поиска\n");
	printf("1.Название соревнований\n");
	printf("2.Сложность\n");
	printf("3.Продолжительность\n");
	printf("4.Длина трассы\n");
	printf("5.Средняя скорость\n");
	scanf("%d", &choice);
	if (choice == 1)
	{
		printf("Введите название соревнований\n");
		scanf("%s", kr1);
		printf("---------------------------------------------------------------------------------------------------------------------------\n");
		printf("|| Название соревнований || Продолжительность гонки(мин) || Длина трассы(метры) || Сложность || Средняя скорость(км / ч) || \n");
		printf("---------------------------------------------------------------------------------------------------------------------------\n");
		for (int i = 0; i < count; i++)
		{
			if (strcmp((gon + i)->name, kr1) == 0)
			{
				printf("||%23s||%26d Мин||%19d М||%11d||%21d Км/ч||\n", (gon + i)->name, (gon + i)->time, (gon + i)->distance, (gon + i)->complexity, (gon + i)->avg_speed);
				printf("---------------------------------------------------------------------------------------------------------------------------\n");
			}


		}
		gon++;
	}
	if (choice == 2)
	{
		printf("Введите сложность\n");
		scanf("%s", kr2);
		printf("---------------------------------------------------------------------------------------------------------------------------\n");
		printf("|| Название соревнований || Продолжительность гонки(мин) || Длина трассы(метры) || Сложность || Средняя скорость(км / ч) || \n");
		printf("---------------------------------------------------------------------------------------------------------------------------\n");
		for (int i = 0; i < count; i++)
		{
			if (strcmp((gon + i)->complexity, kr2) == 0)
			{
				
				printf("||%23s||%26d Мин||%19d М||%11s||%21d Км/ч||\n", (gon + i)->name, (gon + i)->time, (gon + i)->distance, (gon + i)->complexity, (gon + i)->avg_speed);
				printf("---------------------------------------------------------------------------------------------------------------------------\n");
			}


		}
		gon++;
	}
	if (choice == 3)
	{
		printf("Введите продолжительность\n");
		scanf("%d", &kr4);
		printf("---------------------------------------------------------------------------------------------------------------------------\n");
		printf("|| Название соревнований || Продолжительность гонки(мин) || Длина трассы(метры) || Сложность || Средняя скорость(км / ч) || \n");
		printf("---------------------------------------------------------------------------------------------------------------------------\n");
		for (int i = 0; i < count; i++)
		{
			if ((gon + i)->time == kr4)
			{
				
				printf("||%23s||%26d Мин||%19d М||%11s||%21d Км/ч||\n", (gon + i)->name, (gon + i)->time, (gon + i)->distance, (gon + i)->complexity, (gon + i)->avg_speed);
				printf("---------------------------------------------------------------------------------------------------------------------------\n");
			}

		}
		gon++;
	}
	if (choice == 4)
	{
		printf("Введите длину трассы\n");
		scanf("%d", &kr3);
		printf("---------------------------------------------------------------------------------------------------------------------------\n");
		printf("|| Название соревнований || Продолжительность гонки(мин) || Длина трассы(метры) || Сложность || Средняя скорость(км / ч) || \n");
		printf("---------------------------------------------------------------------------------------------------------------------------\n");
		for (int i = 0; i < count; i++)
		{
			if ((gon + i)->distance == kr3)
			{
				
				printf("||%23s||%26d Мин||%19d М||%11s||%21d Км/ч||\n", (gon + i)->name, (gon + i)->time, (gon + i)->distance, (gon + i)->complexity, (gon + i)->avg_speed);
				printf("---------------------------------------------------------------------------------------------------------------------------\n");
			}

		}
		gon++;
	}
	if (choice == 5)
	{
		printf("Введите среднюю скорость\n");
		scanf("%d", &kr5);
		printf("---------------------------------------------------------------------------------------------------------------------------\n");
		printf("|| Название соревнований || Продолжительность гонки(мин) || Длина трассы(метры) || Сложность || Средняя скорость(км / ч) || \n");
		printf("---------------------------------------------------------------------------------------------------------------------------\n");
		for (int i = 0; i < count; i++)
		{
			if ((gon + i)->avg_speed == kr5)
			{
				
				printf("||%23s||%26d Мин||%19d М||%11s||%21d Км/ч||\n", (gon + i)->name, (gon + i)->time, (gon + i)->distance, (gon + i)->complexity, (gon + i)->avg_speed);
				printf("---------------------------------------------------------------------------------------------------------------------------\n");
			}

		}
		gon++;
	}

	return *gon;
}
struct gonka sort(struct gonka* gon, int count)
{
	printf("Сортировка по Средняя скорость * сложность\n");
	struct gonka tmp;
	for (int i = count - 1; i >= 0; i--)
	{
		for (int j = 0; j < i; j++)
		{
			if ((gon[j].avg_speed) > (gon[j + 1].avg_speed))
			{
				tmp = gon[j];
				gon[j] = gon[j + 1];
				gon[j + 1] = tmp;
			}
			gon++;
		}
	}
	return *gon;
}

int main()
{
	setlocale(LC_ALL, "Rus");
	system("chcp 1251");
	system("cls");
	int kol = 0;
	gon = malloc(kol * sizeof(int));
	int flag1 = 1, choice1, choice2, compl, razmermas;
	printf("Выберите функцию\n1.Ввод значений.\n2.Вывод значений\n3.Поиск структуры по заданному критерию\n0.Выход из программы\n");

	while (flag1)
	{
		scanf("%d", &choice1);
		switch (choice1)
		{
		case 1:
			printf("Введите кол-во записей (меньше 50)\n");
			scanf("%d", &kol);
			add(gon, kol);
			break;


		case 2:

			vivod(gon, kol);
			break;


		case 3:


			search(gon, kol);
			break;
		case 4:
			sort(gon, kol);
			vivod(gon, kol);
			break;

		case 0:

			flag1 = 0;
			printf("Программа заверешна\n");
			break;


		}

	}
}
